{
  "name": "fastclick",
  "description": "Polyfill to remove click delays on browsers with touch UIs.",
  "version": "0.5.6",
  "main": "lib/fastclick.js",
  "scripts": [
    "lib/fastclick.js"
  ],
  "license": "MIT",
  "gitHead": "c59e46282d85348dfe9a13db444b97d989f5ce98",
  "readme": "## FT Labs, Google and Facebook will be hosting a discussion about making web apps agnostic to different input technologies at [Edge](http://edgeconf.com/), London, 9 February 2013.\n\n# FastClick\n\nFastClick is a simple, easy-to-use library for eliminating the 300ms delay between a physical tap and the firing of a `click` event on mobile browsers. The aim is to make your application feel less laggy and more responsive while avoiding any interference with your current logic.\n\nFastClick is developed by [FT Labs](http://labs.ft.com/), part of the Financial Times.\n\n## Compatibility\n\nThe library has been deployed as part of the [FT Web App](http://app.ft.com/) and is tried and tested on the following mobile browsers:\n\n* Mobile Safari on iOS 3 and upwards\n* Chrome on iOS 5 and upwards\n* Chrome on Android (ICS)\n* Opera Mobile 11.5 and upwards\n* Android Browser since Android 2\n* PlayBook OS 1 and upwards\n\nFastClick doesn't attach any listeners on desktop browsers as it is not needed. Those that have been tested are:\n\n* Safari\n* Chrome\n* Internet Explorer\n* Firefox\n* Opera\n\n## Usage\n\nInclude fastclick.js in your JavaScript bundle or add it to your HTML page like this:\n\n```html\n<script type='application/javascript' src='/path/to/fastclick.js'></script>\n```\n\nThe script must be loaded prior to instantiating FastClick on any element of the page.\n\nTo instantiate FastClick on the `body`, which is the recommended method of use:\n\n```js\nwindow.addEventListener('load', function() {\n\tnew FastClick(document.body);\n}, false);\n```\n\n### Google Closure Compiler\n\nFastClick supports compilation with `ADVANCED_OPTIMIZATIONS` ('advanced mode'), which should reduce its size by about 70% (60% gzipped). Note that exposure of the `FastClick` variable isn't forced therefore you must compile it along with all of your code.\n\n### AMD\n\nFastClick has AMD (Asynchronous Module Definition) support. This allows it to be lazy-loaded with an AMD loader, such as [RequireJS](http://requirejs.org/).\n\n### Component\n\nFastClick comes with support for installation via the [Component package manager](https://github.com/component/component).\n\n### NPM\n\nInstallation via the [Node Package Manager](https://npmjs.org/package/fastclick) is supported, although Component is preferred as this is not strictly a Node packagage.\n\n### Minification\n\nRun `bin/minify` to build a minified version of FastClick using the Closure Compiler REST API. The minified file is saved to `build/fastclick.min.js`.\n\n## Advanced\n\n### Ignore certain elements with `needsclick` class\nSometimes you need FastClick to ignore certain elements. You can do this easily by adding the `needsclick` class.\n```html\n<a class=\"needsclick\">Ignored by FastClick</a>\n```\n\n#### Use case 1: non-synthetic click required\nInternally, FastClick uses `document.createEvent` to fire a synthetic `click` event as soon as `touchend` is fired by the browser. It then suppresses the additional `click` event created by the browser after that. In some cases, the non-synthetic `click` event created by the browser is required, as described in the [triggering focus example](http://ftlabs.github.com/fastclick/examples/focus.html).\n\nThis is where the `needsclick` class comes in. Add the class to any element that requires a non-synthetic click.\n\n#### Use case 2: Twitter Bootstrap 2.2.2 dropdowns\nAnother example of when to use the `needsclick` class is with dropdowns in Twitter Bootstrap 2.2.2. Bootstrap add its own `touchstart` listener for dropdowns, so you want to tell FastClick to ignore those. If you don't, touch devices will automatically close the dropdown as soon as it is clicked, because both FastClick and Bootstrap execute the synthetic click, one opens the dropdown, the second closes it immediately after.\n\n```html\n<a class=\"dropdown-toggle needsclick\" data-toggle=\"dropdown\">Dropdown</a>\n```\n\n## Examples\n\nFastClick is designed to cope with many different browser oddities. Here are some examples to illustrate this:\n\n* [basic use](http://ftlabs.github.com/fastclick/examples/layer.html) showing the increase in perceived responsiveness\n* [triggering focus](http://ftlabs.github.com/fastclick/examples/focus.html) on an input element from a `click` handler\n* [input element](http://ftlabs.github.com/fastclick/examples/input.html) which never receives clicks but gets fast focus\n\n## Credits and collaboration\n\nThe lead developer of FastClick is [Rowan Beentje](http://twitter.com/rowanbeentje) at FT Labs. This fork is currently maintained by [Matthew Caruana Galizia](http://twitter.com/mcaruanagalizia). All open source code released by FT Labs is licenced under the MIT licence. We welcome comments, feedback and suggestions.  Please feel free to raise an issue or pull request. Enjoy.\n",
  "readmeFilename": "README.md",
  "_id": "fastclick@0.5.6",
  "repository": {
    "type": "git",
    "url": "git://github.com/ftlabs/fastclick.git"
  }
}